/***********************************************************************************
**
** GUIAlphaBlending.h
**
** Компонента для применения блендинга по альфа-каналу
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef GUIALPHABLENDING_H
#define GUIALPHABLENDING_H
//----------------------------------------------------------------------------------
#include "GUIBlending.h"
//----------------------------------------------------------------------------------
class CGUIAlphaBlending : public CGUIBlending
{
	//!Значение для установки альфа-канала
	SETGET(float, Alpha);

public:
	CGUIAlphaBlending(const bool &enabled, const float &alpha);
	virtual ~CGUIAlphaBlending();

	virtual void Draw(const bool &checktrans = false);
};
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
