/***********************************************************************************
**
** GUIBuff.h
**
** Компонента иконки баффа
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef GUIBUFF_H
#define GUIBUFF_H
//----------------------------------------------------------------------------------
class CGUIBuff : public CGUIDrawObject
{
	//!Время жизни
	SETGET(uint, Timer, 0);

	//!Текст баффа для отображения
	SETGET(wstring, Text, L"");

	//!Таймер всплывающей подсказки
	SETGET(uint, TooltipTimer, 0);

	//!Флаг для уменьшения альфа-канала
	SETGET(bool, DecAlpha, true);

	//!Текущее значение альфа-канала
	SETGET(uchar, Alpha, 0xFF);

public:
	CGUIBuff(const ushort &graphic, const uint &timer, const wstring &text);
	virtual ~CGUIBuff();

	virtual void Draw(const bool &checktrans = false);
};
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
