/***********************************************************************************
**
** GUIRadio.h
**
** Компонента для отображения радио-кнопок
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef GUIRADIO_H
#define GUIRADIO_H
//----------------------------------------------------------------------------------
class CGUIRadio : public CGUICheckbox
{
public:
	CGUIRadio(const uint &serial, const ushort &graphic, const ushort &graphicChecked, const ushort &graphicDisabled, const int &x, const int &y);
	virtual ~CGUIRadio();
};
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
