/***********************************************************************************
**
** CityList.cpp
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#include "CityList.h"
#include "Managers/FontsManager.h"
#include "Managers/ClilocManager.h"
#include "Managers/CityManager.h"
//----------------------------------------------------------------------------------
CCityList g_CityList;
//----------------------------------------------------------------------------------
//--------------------------------------CCityItem-----------------------------------
//----------------------------------------------------------------------------------
CCityItem::CCityItem()
: m_LocationIndex(0), m_Name(""), m_Area(""), m_Selected(false), m_City("", L"")
{
}
//----------------------------------------------------------------------------------
CCityItem::~CCityItem()
{
}
//----------------------------------------------------------------------------------
/*!
Инициализация
@return 
*/
void CCityItem::InitCity()
{
	//!Линкуем город
	m_City = g_CityManager.GetCity(m_Name);
}
//----------------------------------------------------------------------------------
//-------------------------------------CCityItemNew---------------------------------
//----------------------------------------------------------------------------------
CCityItemNew::CCityItemNew()
: CCityItem(), m_X(0), m_Y(0), m_Z(0), m_MapIndex(0) //, m_Cliloc(0)
{
}
//----------------------------------------------------------------------------------
CCityItemNew::~CCityItemNew()
{
}
//----------------------------------------------------------------------------------
/*!
Генерация текстуры по ИД клилока
@param [__in] clilocID Индекс клилока
@return 
*/
/*void CCityItemNew::CreateTextTexture(uint clilocID)
{
	//!Очистим текстуру
	m_Texture.Clear();

	//!Используем обработку HTML-тэгов при создании текстуры текста
	g_FontManager.SetUseHTML(true);

	//!Получаем строку клилока с описанием города
	wstring wtext = g_ClilocManager.Cliloc(g_Language)->GetW(clilocID);

	//!Создаем текстуру текста
	g_FontManager.GenerateW(0, m_Texture, wtext.c_str(), 0, 30, 150);

	//!Выключаем обработку HTML-тэгов
	g_FontManager.SetUseHTML(false);
}*/
//----------------------------------------------------------------------------------
//--------------------------------------CCityList-----------------------------------
//----------------------------------------------------------------------------------
CCityList::CCityList()
{
}
//---------------------------------------------------------------------------
CCityList::~CCityList()
{
	Clear();
}
//---------------------------------------------------------------------------
/*!
Получить ссылку на город
@param [__in] index Индекс города
@return
*/
CCityItem CCityList::GetCity(const int &index)
{
	for (deque<CCityItem>::iterator i = m_CityList.begin(); i != m_CityList.end(); i++)
	{
		if (i->LocationIndex == index)
			return *i;
	}

	return CCityItem();
}
//---------------------------------------------------------------------------
/*!
Получить ссылку на город
@param [__in] index Индекс города
@return
*/
void CCityList::Clear()
{
	m_CityList.clear();
}
//---------------------------------------------------------------------------