/***********************************************************************************
**
** Party.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef PARTY_H
#define PARTY_H
//----------------------------------------------------------------------------------
#include "PartyObject.h"
#include "Wisp/WispDataStream.h"
//----------------------------------------------------------------------------------
class CParty
{
	//Серийник лидера пати
	SETGET(uint, Leader);
	//Серийник пригласившего в пати
	SETGET(uint, Inviter);
	//Может ли группа лутать труп игрока
	SETGET(bool, CanLoot);

public:
	CParty();
	~CParty();

	//Члены группы
	CPartyObject Member[10];

	//Обработка пакетов пати
	void ParsePacketData(WISP_DATASTREAM::CDataReader &reader);

	//Содержит ли пати игрока с данным серийником
	bool Contains(const uint &serial);

	//Очистить пати
	void Clear();
};
//----------------------------------------------------------------------------------
extern CParty g_Party;
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
