/***********************************************************************************
**
** QuestArrow.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef QUESTARROW_H
#define QUESTARROW_H
//----------------------------------------------------------------------------------
#include "Globals.h"
//----------------------------------------------------------------------------------
//Класс для работы со стрелкой задания (над головой персонажа)
class CQuestArrow
{
	SETGET(uint, Timer, 0);
	SETGET(ushort, X, 0);
	SETGET(ushort, Y, 0);
	SETGET(bool, Enabled, false);

public:
	CQuestArrow();
	~CQuestArrow();

	//Индекс начальной картинки стрелки
	static const ushort m_Gump = 0x1194;

	//Отрисовать стрелку
	void Draw();
};
//----------------------------------------------------------------------------------
extern CQuestArrow g_QuestArrow;
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
