/***********************************************************************************
**
** Weather.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef WEATHER_H
#define WEATHER_H
//----------------------------------------------------------------------------------
#include "WeatherEffect.h"
//----------------------------------------------------------------------------------
//Класс для работы с погодой
class CWeather
{
	//Тип вогоды
	SETGET(uchar, Type);
	//Максимальное количество эффектов на экране
	SETGET(uchar, Count);
	//Текущее количество эффектов на экране
	SETGET(uchar, CurrentCount);
	//Температура
	SETGET(uchar, Temperature);
	//Время отрисовки
	SETGET(uint, Timer);

private:
	//Направление ветра
	char m_Wind;

	//Таймер смены ветра
	uint m_WindTimer;

	//Время последней смены анимации погоды
	uint m_LastTick;

	float m_SimulationRatio; // скорость общей симуляции зависит от этого значения. Больше - медленней.

public:
	CWeather();
	~CWeather() { m_Effects.clear(); }

	//Погодные эффекты
	deque<CWeatherEffect> m_Effects;
	
	//Выключить погодные эффекты
	void Reset();

	//Сгенерировать эффекты
	void Generate();

	//Отрисовать погодные эффекты
	void Draw(const int &x, const int &y);
};
//----------------------------------------------------------------------------------
extern CWeather g_Weather;
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
