/***********************************************************************************
**
** FastWalk.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef FASTWALK_H
#define FASTWALK_H
//----------------------------------------------------------------------------------
#include "../Globals.h"
//----------------------------------------------------------------------------------
//Класс для обработки стека fastwalk
class CFastWalkStack
{
private:
	//fastwalk стек
	uint m_Keys[MAX_FAST_WALK_STACK_SIZE];

public:
	CFastWalkStack() { memset(m_Keys, 0, sizeof(m_Keys)); }
	~CFastWalkStack() {}

	void SetValue(const int &index, const uint &value);

	void AddValue(const uint &value);

	uint GetValue();
};
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
