/***********************************************************************************
**
** FastWalk.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef FASTWALK_H
#define FASTWALK_H
//----------------------------------------------------------------------------------
#include "../Globals.h"
//----------------------------------------------------------------------------------
//Класс для обработки стека fastwalk
class CFastWalkStack
{
private:
	//fastwalk стек
	uint m_Keys[MAX_FAST_WALK_STACK_SIZE + 1];

	//Текущий индекс
	int m_Current;

	//Глубина стека
	int m_Deep;

public:
	CFastWalkStack() :m_Current(0), m_Deep(0) { memset(m_Keys, 0, sizeof(m_Keys)); }
	~CFastWalkStack() {}

	void Reset(); //Очистить стек

	void Push(const uint &key); //Добавить элемент в стек
	uint Pop(); //Получить элемент и удалить его из стека
};
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
