/***********************************************************************************
**
** WalkData.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef WALKDATA_H
#define WALKDATA_H
//----------------------------------------------------------------------------------
#include "../Globals.h"
//----------------------------------------------------------------------------------
//Класс для работы с шагом
class CWalkData
{
	SETGET(short, X);
	SETGET(short, Y);
	SETGET(char, Z);
	SETGET(uchar, Direction);

public:
	//Ссылки на следующий и предыдущий элементы
	CWalkData *m_Next;
	CWalkData *m_Prev;

	CWalkData() :m_X(0), m_Y(0), m_Z(0), m_Direction(0), m_Next(NULL), m_Prev(NULL) {}
	~CWalkData() {}

	//Бег или хотьба
	bool Run() { return (m_Direction & 0x80); }

	//Получить пиксельное смещение для анимации
	void GetOffset(float &x, float &y, float &steps);
};
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
