/***********************************************************************************
**
** WalkStack.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef WALKSTACK_H
#define WALKSTACK_H
//----------------------------------------------------------------------------------
#include "WalkData.h"
//----------------------------------------------------------------------------------
//Класс для хранения шагов
class CWalkStack
{
private:
public:
	CWalkStack() :m_Items(NULL) {}
	~CWalkStack() { Clear(); }

	//Список шагов
	CWalkData *m_Items;

	//Верхний шаг
	CWalkData *Top();

	void Init() { m_Items = NULL; }
	void Clear();

	//Добавить шаг в стек
	void Push(CWalkData *obj);

	//Удалить шаг из стека
	void Pop();

	//Есть ли в стеке шаги
	bool Empty() { return (m_Items == NULL); }
};
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
