/***********************************************************************************
**
** GameEffectMoving.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef GAMEEFFECTMOVING_H
#define GAMEEFFECTMOVING_H
//----------------------------------------------------------------------------------
#include "GameEffectDrag.h"
//----------------------------------------------------------------------------------
//Движущийся эффект
class CGameEffectMoving : public CGameEffectDrag
{
	//!Угол поворота эффекта
	SETGET(float, Angle);
	SETGET(int, OffsetZ);

public:
	CGameEffectMoving();
	virtual ~CGameEffectMoving();

	/*!
	Обновить эффект
	@return
	*/
	virtual void Update(class CGameObject *parent);
};
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
