/***********************************************************************************
**
** GameEffectDrag.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#include "GameEffectDrag.h"
#include "../Managers/EffectManager.h"
//----------------------------------------------------------------------------------
CGameEffectDrag::CGameEffectDrag()
: CGameEffect(), m_OffsetX(0), m_OffsetY(0)
{
}
//----------------------------------------------------------------------------------
CGameEffectDrag::~CGameEffectDrag()
{
}
//----------------------------------------------------------------------------------
/*!
Обновить эффект
@return
*/
void CGameEffectDrag::Update(CGameObject *parent)
{
	m_OffsetX += 4;
	m_OffsetY += 4;

	if (m_Duration < g_Ticks)
		g_EffectManager.RemoveEffect(this);
}
//----------------------------------------------------------------------------------
