/***********************************************************************************
**
** ObjectOnCursor.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef OBJECTONCURSOR_H
#define OBJECTONCURSOR_H
//----------------------------------------------------------------------------------
#include "GameItem.h"
//----------------------------------------------------------------------------------
//!Класс объекта на курсоре
class CObjectOnCursor : public CGameItem
{
	//!Раньше был в стеке
	SETGET(bool, Separated, false);
	//!Предмет удален
	SETGET(bool, Deleted, false);
	//!Бросили предмет (на землю/в контейнер/на персонажа)
	SETGET(bool, Dropped, false);
	//!Это игровая фигура
	SETGET(bool, IsGameFigure, false);
	//!Количество для перемещения
	SETGET(uint, DragCount, 1);
	//!Не отображать при рендере
	SETGET(bool, NoDraw, false);

public:
	CObjectOnCursor();
	CObjectOnCursor(CGameItem *obj);
	virtual ~CObjectOnCursor() {}
};
//----------------------------------------------------------------------------------
//!Указатель на объект в руке (на курсоре)
extern CObjectOnCursor *g_ObjectInHand;
//----------------------------------------------------------------------------------
#endif
