/***********************************************************************************
**
** ShopItem.h
**
** Copyright (C) August 2016 Hotride
**
************************************************************************************
*/
//----------------------------------------------------------------------------------
#ifndef SHOPITEM_H
#define SHOPITEM_H
//----------------------------------------------------------------------------------
#include "../Globals.h"
//----------------------------------------------------------------------------------
//!Класс объекта магазина
class CShopItem
{
	//!Количество, которое выделено в списке покупок
	SETGETEX(int, Count);
	//!Имя предмета для списка покупок
	SETGET(string, Name);
	//!Цена предмета
	SETGET(uint, Price);
	//!Выделен в байлисте
	SETGET(bool, Selected);

public:
	CShopItem();
	~CShopItem();
};
//----------------------------------------------------------------------------------
#endif
//----------------------------------------------------------------------------------
